# Dictionaries and lists to be used for lookup during conversion

# Dictionary mapping verbs between polite and regular form.
VERBS = {
    "いらっしゃる": "来る",
    "おっしゃる": "言う",
    "申し上げる": "言う",
    "申し伝える": "伝える",
    "申す": "言う",
    "召し上がる": "食べる",
    "居る": "いる",
    "存じる": "知る",
    "存ずる": "思う",
    "頂く": "もらう",
    "致す": "為る",
    "為さる": "為る",
    "伺う": "行く",
    "仰る": "言う",
    "参る": "いく",
    "下さる": "くれる",
    "畏まる": "分かる",
}

# Dictionary mapping nouns between polite and regular form.
NOUNS = {
    "わたくし": "わたし",
    "本日": "今日",
    "先日": "この間",
    "直ちに": "今すぐ",
    "こちら": "こっち",
    "そちら": "そっち",
    "どちら": "どっち",
    "少々": "少し",
    "弊社": "当社",
    "今後": "これから",
    
}

# Dictionary mapping polite nouns to regular verbs
NOUN_VERBS = {
    "拝見": "見る",
    "拝読": "読む",
    "拝聴": "聞く",
    "頂戴": "もらう",
    "検討": "考える",
    "考え": "考える",
    "座り": "座る",
    "読み": "読む",
}

# Kanji to Hiragana
KANJI = {
    "遣る": "やる",
    "若し": "もし",
    "其れ": "それ",
    "其の": "その",
    "其方": "そちら",
    "此れ": "これ",
    "此の": "この",
    "此方": "こちら",
    "何れ": "どれ",
    "何の": "どの",
    "何方": "どちら",
    "成る": "なる",
    "余り": "あまり",
    "無い": "ない",
    "纏める": "まとめる",
    "先ず": "まず",
    "此処": "ここ",
    "一寸": "ちょっと",
    "態々": "わざわざ",
    "矢張り": "やはり",
    "仮令": "たとえ",
    "於く": "おく",
    "成る可く": "なるべく",
    "急度": "きっと",
    "書き替える": "書き換える",
    
}

# Special phrases to replace initially
REPLACE = {
    "ありがとうございました": "ありがとう",
    "ありがとうございます": "ありがとう",
    "有難うございました": "ありがとう",
    "有難うございます": "ありがとう",
    "よろしくお願い致します": "よろしく",
    "よろしくお願いします": "よろしく",
    "お願いします": "お願い",
    "よろしければ": "よかったら",
    "承知致しました": "分かった",
    "すみませんでした": "ごめん",
    "すみません": "ごめん",
    "お疲れ様です": "お疲れ",
    "お疲れ様": "お疲れ",
    "皆さん": "みんな",
    "みなさん": "みんな",
    "するんですか": "するの",
    "でございます": "です",
    "ございません": "ない",
    "そのような": "そんな",
    "このような": "こんな",
    "どのような": "どんな",
    "ませんでした": "なかった",
    "ません": "ない",
    "いかがでしょうか": "どうだ",
    "いかが": "どう",
    "でしょう": "だろう",
    "ければ": "かったら",
    "では": "じゃ",
}

# Dictionary mapping special words (not noun or verb) between polite and regular form.
SPECIAL = {
    "はい": "うん",
    "ええ": "うん",
    "いいえ": "ううん",
    "ほど": "くらい",
    "及び": "と",
    "では": "じゃあ",
    "へ": "に",
}

E_SOUNDS = set(['え', 'け', 'せ', 'て', 'ね', 'へ', 'め', 'れ'])